package consts



const (
	Cancel        = "Отмена"
	Submit        = "Отправить"
	ChangeName    = "Изменить имя"
	ChangeAge     = "Изменить возраст"
	ChangeCity    = "Изменить готовность к очным встречам"
	ChangeRequest = "Изменить запрос"
	ChangeHealth  = "Изменить информацию о здоровье"
	ChangeContact = "Изменить контактные данные"

	StartMessage = "Используйте /start что бы начать."

	WelcomeMessage = `Добрый день, уважаемые друзья!

Мы — студенты кафедры клинической психологии Университета «Дубна».
Здесь вы можете оставить заявку на бесплатные очные консультации психолога в г. Дубне. Все консультации проводятся под супервизией преподавателей (разбор случаев без указания личных данных для определения корректного пути работы).
В свою очередь, мы рассчитываем на вашу готовность серьезно работать над своей проблемой совместно с психологом.
Благодарим за внимание!

Если у вас есть вопросы, можете задать их в сообщениях сообщества (vk.com/club232594381).`

	GoToSurvey   = `Хотите оставить заявку?`
	EnterName    = "Как мы можем к Вам обращаться?"
	EnterAge     = "Подскажите, сколько Вам лет?"
	EnterCity    = "Вы готовы приходить на встречи очно в городе Дубна? (К сожалению, не все студенты готовы брать на онлайн-консультации, поэтому вероятность попасть на очное консультирование выше, чем онлайн)"
	EnterRequest = "Пожалуйста, попробуйте описать Ваш запрос в одном или двух предложениях (что Вас беспокоит или что хотелось бы изменить)."
	EnterHealth  = "Есть ли у Вас жалобы на здоровье, хронические заболевания? Если да, пожалуйста, укажите их."
	EnterContact = "Как мы можем связаться с вами? Просим оставить вас ссылку на соц. сети, почту или номер телефона (и предпочтительный тип связи по нему)."
	Accept       = "Информация верна?"
	Thanks       = "Благодарим за обращение! Мы рассмотрим заявку и свяжемся с Вами в случае, если найдется специалист."
	Yes          = "Да"
	No           = "Нет"

	NameKey    = "name"
	AgeKey     = "age"
	CityKey    = "city"
	RequestKey = "request"
	HealthKey  = "health"
	ContactKey = "contact"

)
