package consts



const (
	Cancel        = "Отмена"
	Submit        = "Отправить"
	ChangeName    = "Изменить имя"
	ChangeAge     = "Изменить возраст"
	ChangeCity    = "Изменить готовность к очным встречам"
	ChangeRequest = "Изменить запрос"
	ChangeHealth  = "Изменить информацию о здоровье"
	ChangeContact = "Изменить контактные данные"

	StartMessage = "Используйте /start что бы начать."

	WelcomeMessage = `Добрый день, уважаемые друзья!
Здесь вы можете оставить заявку на бесплатные индивидуальные психологические консультации от студентов кафедры "Клиническая психология".
Они проводятся очно в Дубне, под супервизией преподавателей кафедры (с разбором случаев без указания личных данных для корректного пути работы).
От вас мы, в свою очередь, ожидаем готовности серьезно работать над своей проблемой совместно с психологом.

Спектры проблем и переживаний, с которыми вы можете к нам обратиться:
• трудности в межличностных отношениях: дружеских, романтических, семейных и т.д.;
• трудности в учёбе: стресс, страх публичных выступлений, тревожность, прокрастинация, тремор при общении с коллегами и преподавателями, страх совершать ошибки;
• обеспокоенность своим психологическим состоянием: вредные привычки, нестабильная самооценка и эмоциональность, страхи, трудности в проявлении чувств и сопереживании, стремление к соперничеству, болезненное восприятие критики, невозможность "понять себя", психосоматические симптомы, частые проблемы со здоровьем после стрессов.

Если у вас есть вопросы, можете задать их в сообщениях сообщества (vk.com/club232594381).`

	GoToSurvey   = `Хотите оставить заявку?`
	EnterName    = "Как мы можем к Вам обращаться?"
	EnterAge     = "Подскажите, сколько Вам лет?"
	EnterCity    = "Вы готовы приходить на встречи очно в городе Дубна? (К сожалению, не все студенты готовы брать на онлайн-консультации, поэтому вероятность попасть на очное консультирование выше, чем онлайн)"
	EnterRequest = "Пожалуйста, попробуйте описать Ваш запрос в одном или двух предложениях (что Вас беспокоит или что хотелось бы изменить)."
	EnterHealth  = "Есть ли у Вас жалобы на здоровье, хронические заболевания? Если да, пожалуйста, укажите их."
	EnterContact = "Как мы можем связаться с вами? Просим оставить вас ссылку на соц. сети, почту или номер телефона (и предпочтительный тип связи по нему)."
	Accept       = "Информация верна?"
	Thanks       = "Благодарим за обращение! Мы рассмотрим заявку и свяжемся с Вами в случае, если найдется специалист."
	Yes          = "Да"
	No           = "Нет"

	NameKey    = "name"
	AgeKey     = "age"
	CityKey    = "city"
	RequestKey = "request"
	HealthKey  = "health"
	ContactKey = "contact"

)
